In [1]:
# iloc : integer location
# 정수값으로 row 선택 -> column 선택

import pandas as pd
df = pd.read_excel('member.xlsx', index_col='번호')
df

     이름  출생연도 출생지  담당파트  체중
번호
1번    진  1992  과천  서브보컬  61
2번    뷔  1995  대구  서브보컬  63
3번   정국  1997  부산  메인보컬  66
4번   슈가  1993  대구  리드래퍼  57
5번  제이홉  1994  광주  메인댄서  59
6번   RM  1994  서울    리더  70
7번   지민  1995  부산  메인댄서  58

In [2]:
df.iloc[0] # 0번째 위치의 데이터

이름         진
출생연도    1992
출생지       과천
담당파트    서브보컬
체중        61
Name: 1번, dtype: object

In [3]:
df.iloc[0:5] # 0 ~ 4번째 데이터

     이름  출생연도 출생지  담당파트  체중
번호
1번    진  1992  과천  서브보컬  61
2번    뷔  1995  대구  서브보컬  63
3번   정국  1997  부산  메인보컬  66
4번   슈가  1993  대구  리드래퍼  57
5번  제이홉  1994  광주  메인댄서  59

In [4]:
df.iloc[0, 1] # 0번째 위치의 출생연도

1992

In [5]:
df.iloc[4, 2] # 4번째 위치의 출생지

'광주'

In [6]:
df.iloc[[0, 2], 2] # 0번째, 2번째 위치의 출생지

번호
1번    과천
3번    부산
Name: 출생지, dtype: object

In [7]:
df.iloc[[0, 2], [2, 3]] # 0, 2번째 출생지, 담당파트

   출생지  담당파트
번호
1번  과천  서브보컬
3번  부산  메인보컬

In [8]:
df.iloc[0:4, 2:4]

   출생지  담당파트
번호
1번  과천  서브보컬
2번  대구  서브보컬
3번  부산  메인보컬
4번  대구  리드래퍼